TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/fpufastrts/fpufastrts_f64_f2838x.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "337bga" --part "F2838x_337bga" --product "C2000WARE"
 * 
 */

/**
 * Import the modules used in this configuration.
 */
const FPUfastRTS  = scripting.addModule("/libraries/math/FPUfastRTS/FPUfastRTS.js", {}, false);
const FPUfastRTS1 = FPUfastRTS.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
FPUfastRTS1.$name             = "myFFR0";
FPUfastRTS1.fpuType           = "FPU64";
FPUfastRTS1.cordic.create(1);
FPUfastRTS1.cordic[0].$name   = "myCOR0";
FPUfastRTS1.cordic[0].numIter = 60;

const FPU   = scripting.addModule("/libraries/math/FPU/FPU.js", {}, false);
FPU.fpuType = "FPU64";
